Revit 2027 API
GroupNode.GetTransform Method
 A transformation matrix associated with the node.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public Transform GetTransform()
Public Function GetTransform As Transform
public:
Transform^ GetTransform()
member GetTransform : unit -> Transform
Return Value
Transform
See Also
Reference
GroupNode Class
Autodesk.Revit.DB Namespace